[
  {
    "id": "r1",
    "title": "Spaghetti Aglio e Olio",
    "description": "Classic Italian spaghetti tossed with garlic, olive oil, chili flakes and parsley.",
    "cuisine": "Italian",
    "difficulty": "easy",
    "time": 20,
    "servings": 2,
    "diet": ["vegetarian"],
    "ingredients": [{"name":"spaghetti","qty":"200g"},{"name":"garlic","qty":"4 cloves"},{"name":"olive oil","qty":"4 tbsp"},{"name":"chili flakes","qty":"1 tsp"},{"name":"parsley","qty":"2 tbsp"}],
    "steps": [
      "Bring a large pot of salted water to a rolling boil and cook the spaghetti until al dente according to package instructions (about 8-10 minutes). Reserve 1/2 cup of the pasta cooking water before draining.",
      "While pasta cooks, thinly slice the garlic. Heat the olive oil in a large skillet over medium heat, add the garlic and chili flakes and sauté gently until the garlic is fragrant and just turning golden (do not burn).",
      "Add a few tablespoons of reserved pasta water to the skillet to create a silky sauce, then add the drained spaghetti and toss well to coat. Remove from heat, stir in chopped parsley, taste and season with salt and pepper, and serve immediately."
    ],
    "nutrition": {"calories":520,"protein":15}
  },
  {
    "id":"r2","title":"Chicken Stir Fry","description":"Quick Chinese-style stir-fry with tender chicken and crisp vegetables in a savory soy sauce.","cuisine":"Chinese","difficulty":"medium","time":25,"servings":2,"diet":[],"ingredients":[{"name":"chicken","qty":"300g"},{"name":"soy sauce","qty":"2 tbsp"},{"name":"vegetables","qty":"200g"}],"steps":["Cut the chicken into thin strips and marinate briefly with 1 tbsp soy sauce and a pinch of pepper for 10 minutes.","Prepare and chop the vegetables into bite-sized pieces and have all sauce ingredients measured (extra soy sauce, a splash of rice vinegar or sesame oil if you like).","Heat a wok or large skillet until very hot, add a high-smoke oil, quickly sear the chicken until just cooked through and remove to a plate.","Add a little more oil, stir-fry the vegetables until crisp-tender, return the chicken to the pan, add remaining soy sauce and any other seasoning, toss to combine and serve over rice or noodles."],"nutrition":{"calories":450,"protein":35}},
  {"id":"r3","title":"Chickpea Curry","description":"Comforting Indian chickpea curry simmered in a spiced tomato sauce.","cuisine":"Indian","difficulty":"easy","time":30,"servings":3,"diet":["vegan","gluten-free"],"ingredients":[{"name":"chickpeas","qty":"400g"},{"name":"tomato","qty":"2"},{"name":"onion","qty":"1"}],"steps":["Finely chop the onion, garlic and ginger. Heat oil in a pan and sauté the onion until translucent, then add garlic and ginger.","Stir in ground spices (cumin, coriander, turmeric, garam masala) and cook briefly until aromatic.","Add chopped tomatoes and cook until they soften and break down into a sauce.","Add drained/canned chickpeas, a splash of water or stock, simmer for 10-15 minutes until flavors meld. Adjust salt and serve with rice or flatbread."],"nutrition":{"calories":380,"protein":18}},
  {"id":"r4","title":"Pancakes","description":"Fluffy breakfast pancakes — simple batter cooked until golden and served warm.","cuisine":"American","difficulty":"easy","time":20,"servings":4,"diet":[],"ingredients":[{"name":"flour","qty":"200g"},{"name":"milk","qty":"300ml"},{"name":"egg","qty":"1"}],"steps":["In a bowl whisk together flour, a pinch of salt and a little sugar. In another bowl whisk the egg with milk.","Pour the wet into the dry ingredients and whisk until you have a smooth batter; let it rest for 5–10 minutes.","Heat a non-stick skillet over medium heat and lightly grease. Pour a ladle of batter and cook until bubbles form on the surface, flip and cook the other side until golden. Repeat and keep pancakes warm."],"nutrition":{"calories":350,"protein":8}},
  {"id":"r5","title":"Quinoa Salad","description":"Light Mediterranean quinoa salad with cucumber, herbs and crumbled feta.","cuisine":"Mediterranean","difficulty":"easy","time":15,"servings":2,"diet":["vegetarian","gluten-free"],"ingredients":[{"name":"quinoa","qty":"150g"},{"name":"cucumber","qty":"1"},{"name":"feta","qty":"50g"}],"steps":["Rinse quinoa under cold water, then cook in salted water following package instructions and let cool slightly.","Chop cucumber, tomatoes and herbs (parsley or mint) and crumble the feta.","Whisk a simple dressing of olive oil, lemon juice, salt and pepper. Toss the quinoa with vegetables, add dressing to taste and serve at room temperature or chilled."],"nutrition":{"calories":300,"protein":10}},
  {"id":"r6","title":"Beef Tacos","description":"Crispy tortillas filled with seasoned beef, fresh lettuce and classic toppings.","cuisine":"Mexican","difficulty":"medium","time":35,"servings":4,"diet":[],"ingredients":[{"name":"beef","qty":"400g"},{"name":"tortillas","qty":"8"},{"name":"lettuce","qty":"100g"}],"steps":["Heat a pan and brown the minced beef with chopped onion and a taco spice mix (chili powder, cumin, paprika), cooking until no pink remains.","Warm the tortillas in a dry skillet or wrapped in foil in the oven.","Shred lettuce and prepare any toppings (cheese, salsa, sour cream). Assemble warm tortillas with beef and desired toppings and serve immediately."],"nutrition":{"calories":600,"protein":28}},
  {"id":"r7","title":"Lentil Soup","description":"Hearty lentil soup seasoned with vegetables and a squeeze of lemon for brightness.","cuisine":"Middle Eastern","difficulty":"easy","time":40,"servings":4,"diet":["vegan","gluten-free"],"ingredients":[{"name":"lentils","qty":"250g"},{"name":"carrot","qty":"1"},{"name":"celery","qty":"1 stalk"}],"steps":["Chop carrot, celery and onion. Heat oil in a large pot and sauté until softened.","Add lentils and enough vegetable stock to cover by a couple of inches, bring to a boil then reduce to a simmer.","Cook until lentils are tender (20–30 mins). Season with salt, pepper and lemon juice; optionally blend partially for a creamier texture and serve hot."],"nutrition":{"calories":260,"protein":18}},
  {"id":"r8","title":"Grilled Salmon","description":"Simple grilled salmon with lemon — quick, healthy and flavorful.","cuisine":"International","difficulty":"medium","time":20,"servings":2,"diet":["gluten-free"],"ingredients":[{"name":"salmon","qty":"300g"},{"name":"lemon","qty":"1"}],"steps":["Preheat a grill or grill pan to medium-high and oil the grates.","Pat salmon dry, season with salt and pepper and brush with a little oil.","Grill skin-side down for 4–5 minutes, flip and cook 1–3 minutes more depending on thickness until just cooked through. Rest for a few minutes, squeeze lemon over fish and serve."],"nutrition":{"calories":420,"protein":34}},
  {"id":"r9","title":"Veggie Omelette","description":"Quick omelette loaded with sautéed veggies — great for breakfast or a light meal.","cuisine":"French","difficulty":"easy","time":10,"servings":1,"diet":["vegetarian","gluten-free"],"ingredients":[{"name":"egg","qty":"2"},{"name":"bell pepper","qty":"1"},{"name":"onion","qty":"1/2"}],"steps":["Dice the bell pepper and onion and sauté in a small non-stick pan until softened.","Beat the eggs with a pinch of salt and pepper, pour them over the vegetables and cook over medium-low heat until the edges set.","Use a spatula to fold the omelette in half and slide onto a plate. Serve immediately."],"nutrition":{"calories":220,"protein":14}},
  {"id":"r10","title":"Tomato Bruschetta","description":"Fresh tomato and basil topping served on crisp toasted bread — a bright Italian starter.","cuisine":"Italian","difficulty":"easy","time":15,"servings":2,"diet":["vegetarian"],"ingredients":[{"name":"bread","qty":"4 slices"},{"name":"tomato","qty":"2"},{"name":"basil","qty":"5 leaves"}],"steps":["Dice tomatoes and mix with chopped basil, a drizzle of olive oil, salt and pepper; let it marinate briefly.","Toast or grill the bread slices until golden, rub with a cut garlic clove for extra flavor.","Spoon the tomato mixture on the toasts just before serving to avoid sogginess."],"nutrition":{"calories":260,"protein":6}},
  {"id":"r11","title":"Shrimp Fried Rice","description":"Stir-fried shrimp and rice with egg — a fast, satisfying one-pan meal.","cuisine":"Asian","difficulty":"medium","time":25,"servings":3,"diet":[],"ingredients":[{"name":"shrimp","qty":"250g"},{"name":"rice","qty":"300g"},{"name":"egg","qty":"1"}],"steps":["Use day-old cooked rice if possible; break up any clumps. Peel and devein shrimp if needed.","Heat a wok or large pan with oil, quickly stir-fry shrimp until just cooked and set aside. Scramble the egg in the pan and set aside.","Stir-fry vegetables if using, add rice, shrimp and egg back to the pan, toss with soy sauce and sesame oil, adjust seasoning and serve hot."],"nutrition":{"calories":480,"protein":30}},
  {"id":"r12","title":"Caesar Salad","description":"Crunchy Caesar with crisp lettuce, parmesan and a tangy dressing.","cuisine":"American","difficulty":"easy","time":10,"servings":2,"diet":[],"ingredients":[{"name":"lettuce","qty":"200g"},{"name":"parmesan","qty":"30g"},{"name":"croutons","qty":"50g"}],"steps":["Wash and chop the lettuce into bite-sized pieces and place in a large bowl.","Prepare a simple Caesar-style dressing (anchovy, garlic, lemon, mustard, olive oil) or use a store-bought alternative.","Toss lettuce with dressing, sprinkle with grated parmesan and croutons, serve immediately."],"nutrition":{"calories":330,"protein":8}},
  {"id":"r13","title":"Mushroom Risotto","description":"Creamy mushroom risotto — requires attention but rewards with rich, savory flavors.","cuisine":"Italian","difficulty":"hard","time":50,"servings":4,"diet":["vegetarian"],"ingredients":[{"name":"arborio rice","qty":"300g"},{"name":"mushroom","qty":"200g"},{"name":"parmesan","qty":"50g"}],"steps":["Clean and slice mushrooms, sauté them in butter or oil until golden and set aside.","In a separate pan, sweat finely chopped onion until translucent, add arborio rice and toast briefly.","Ladle hot stock gradually into the rice while stirring frequently, adding the mushrooms back halfway through. Continue until rice is creamy and al dente.","Finish by stirring in butter and grated parmesan, season with salt and pepper and serve immediately."],"nutrition":{"calories":520,"protein":12}},
  {"id":"r14","title":"Tofu Stir Fry","description":"Crispy pan-fried tofu tossed with vibrant vegetables and savory soy glaze.","cuisine":"Asian","difficulty":"easy","time":20,"servings":2,"diet":["vegan"],"ingredients":[{"name":"tofu","qty":"250g"},{"name":"soy sauce","qty":"2 tbsp"},{"name":"mixed vegetables","qty":"200g"}],"steps":["Press tofu to remove excess water, then cut into cubes and season lightly.","Heat a non-stick pan with oil and fry tofu cubes until golden on all sides; remove and set aside.","In the same pan stir-fry vegetables until tender-crisp, return tofu to the pan and add soy sauce and a splash of water or stock, toss to coat and serve over rice."],"nutrition":{"calories":340,"protein":22}},
  {"id":"r15","title":"Greek Yogurt Parfait","description":"Layered Greek yogurt with honey and granola for a quick, healthy treat.","cuisine":"Greek","difficulty":"easy","time":5,"servings":1,"diet":["vegetarian"],"ingredients":[{"name":"greek yogurt","qty":"200g"},{"name":"honey","qty":"1 tbsp"},{"name":"granola","qty":"50g"}],"steps":["In a glass or bowl layer a portion of Greek yogurt, drizzle with honey and add a layer of granola or fresh fruit.","Repeat layers if desired and finish with a final drizzle of honey and a few berries on top. Serve immediately."],"nutrition":{"calories":280,"protein":12}},
  {"id":"r16","title":"Fish and Chips","description":"Classic British fish and chips — crispy battered fish with golden fries and tartar sauce.","cuisine":"British","difficulty":"medium","time":40,"servings":3,"diet":[],"ingredients":[{"name":"white fish","qty":"500g"},{"name":"potatoes","qty":"400g"}],"steps":["Cut potatoes into chips and soak in cold water for 10 minutes, then pat dry.","Heat oil to the appropriate frying temperature. Coat fish in a light batter and fry until golden and crisp; remove and drain.","Fry chips until golden and cooked through, drain, season with salt and serve the fish and chips together with lemon wedges and tartar sauce."],"nutrition":{"calories":900,"protein":40}},
  {"id":"r17","title":"Stuffed Peppers","description":"Bell peppers stuffed with a savory rice and meat mixture, baked until tender.","cuisine":"Mediterranean","difficulty":"medium","time":60,"servings":4,"diet":["gluten-free"],"ingredients":[{"name":"bell pepper","qty":"4"},{"name":"rice","qty":"150g"},{"name":"minced meat","qty":"300g"}],"steps":["Cook the rice until just tender and set aside. Brown the minced meat with onion, garlic and seasoning, then stir in the cooked rice and any herbs or tomato sauce you like.","Cut the tops off the peppers, remove seeds, stuff with the meat-and-rice mixture, place in a baking dish, top with a little cheese if using and bake at 180°C (350°F) for 30–40 minutes until peppers are tender."],"nutrition":{"calories":450,"protein":20}},
  {"id":"r18","title":"Avocado Toast","description":"Simple avocado toast — creamy mashed avocado on crisp toast, seasoned to taste.","cuisine":"International","difficulty":"easy","time":5,"servings":1,"diet":["vegetarian"],"ingredients":[{"name":"bread","qty":"1 slice"},{"name":"avocado","qty":"1/2"}],"steps":["Toast the bread until crisp and golden.","Mash the avocado with a fork, season with salt, pepper and a squeeze of lemon, spread onto toast and finish with a drizzle of olive oil or chili flakes if desired."],"nutrition":{"calories":220,"protein":4}},
  {"id":"r19","title":"Pad Thai","description":"Classic Thai stir-fried noodles with savory-sweet sauce, shrimp and crushed peanuts.","cuisine":"Thai","difficulty":"medium","time":35,"servings":3,"diet":[],"ingredients":[{"name":"rice noodles","qty":"250g"},{"name":"shrimp","qty":"200g"},{"name":"peanuts","qty":"30g"}],"steps":["Soak the rice noodles in warm water until pliable according to package instructions and drain.","Prepare the Pad Thai sauce (tamarind paste, fish sauce, palm sugar, lime) and have toppings ready (peanuts, bean sprouts, green onion).","Stir-fry protein in a hot pan, push to the side and scramble an egg, then add noodles and sauce and toss until coated and heated through. Serve topped with crushed peanuts and lime wedges."],"nutrition":{"calories":550,"protein":25}},
  {"id":"r20","title":"Black Bean Burrito","description":"Hearty black bean burrito with rice and toppings — fast, filling and vegetarian-friendly.","cuisine":"Mexican","difficulty":"easy","time":20,"servings":2,"diet":["vegetarian"],"ingredients":[{"name":"black beans","qty":"200g"},{"name":"tortilla","qty":"2"},{"name":"rice","qty":"100g"}],"steps":["Warm the black beans in a saucepan with cumin, garlic and a splash of water; mash lightly for a creamier texture.","Warm the tortillas and layer with rice, beans and any other fillings (cheese, salsa, avocado), fold and roll tightly. Serve with a side of salsa or sour cream."],"nutrition":{"calories":480,"protein":18}}
]
